app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books"  ORDER BY "books"."created_at" DESC

  def create
    @book = current_user.books.build(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dsf"], ["author", "sdf"], ["description", "sdgyfg"], ["user_id", 1], ["created_at", "2018-03-03 21:57:13.716114"], ["updated_at", "2018-03-03 21:57:13.716114"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?