app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."book_id" = ? AND "comments"."id" = ? LIMIT 1  [["book_id", 1], ["id", 1]]
---
  def edit
    @book = Book.find(params[:book_id])
    @comment = @book.comments.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dsf"], ["book_id", 1], ["created_at", "2018-03-03 17:29:36.971008"], ["updated_at", "2018-03-03 17:29:36.971008"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2018-03-03 17:29:36.985367"], ["id", 1]]
---
  def create
    @book = Book.find(params[:book_id])
    @comment = @book.comments.create(comment_params)
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "rrrraaa"], ["updated_at", "2018-03-03 18:10:11.503055"], ["id", 4]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 4]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)
        format.html { redirect_to book_path(@book = Book.find(params[:book_id])), notice: 'Comment was successfully updated.' }

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    @comment.destroy
    respond_to do |format|
      format.html { redirect_to book_path(@book = Book.find(params[:book_id])), notice: 'Comment was successfully destroyed.' }